tutorials/multiphase/multiphaseEulerFoam/RAS/bubbleColumnPolydisperse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiphaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.005;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1;

functions
{
    #includeFunc fieldAverage(U.air, U.water, alpha.air, p)

    numberDensity
    {
        type                sizeDistribution;
        functionObjectLibs  ("libmultiphaseEulerFoamFunctionObjects.so");

        writeControl        outputTime;
        writeInterval       1;

        populationBalance   bubbles;
        regionType          cellZone;
        name                zone;
        functionType        number;
        coordinateType      diameter;
        densityFunction     yes;
    }
}


// ************************************************************************* //
